
{
  "hero.greeting": "Olá, eu sou",
  "hero.intro": "Líder de tecnologia e produto com mais de 10 anos em software",
  "about.title": "Sobre Mim",
  "about.description": "Sou um líder de tecnologia e produto com mais de 10 anos de experiência na indústria de software. Minha jornada me levou da escrita de código à liderança de equipes multifuncionais e à moldagem do futuro das soluções de HRTech na América Latina.",
  "work.title": "Trabalhos Selecionados",
  "work.viewAll": "Ver Todos",
  "blog.title": "Posts Recentes",
  "blog.readMore": "Leia Mais",
  "contact.title": "Entre em Contato",
  "contact.description": "Tem um projeto em mente? Vamos trabalhar juntos para criar algo incrível.",
  "contact.name": "Seu Nome",
  "contact.email": "Endereço de Email",
  "contact.message": "Sua Mensagem",
  "contact.send": "Enviar Mensagem",
  "contact.success": "Mensagem enviada com sucesso!",
  "speaking.title": "Palestras",
  "speaking.intro": "Eu falo em conferências e eventos sobre desenvolvimento de produtos, liderança e estratégia de tecnologia.",
  "mentorship.title": "Mentoria",
  "mentorship.intro": "Ofereço mentoria para quem busca crescimento em suas carreiras tech e de produto.",
  "about.career": "Minha Jornada Profissional",
  "about.career.engineer": "De Engenheiro de Software a Estrategista de Produto",
  "about.career.product": "Head de Produto na Pontotel",
  "about.skills": "Habilidades & Ferramentas",
  "about.philosophy": "Minha Filosofia de Produto",
  "about.cpo": "No Caminho para CPO",
  "about.more": "Um Pouco Mais Sobre Mim",
  "nav.home": "Início",
  "nav.blog": "Blog",
  "nav.speaking": "Palestras",
  "nav.mentorship": "Mentoria",
  "nav.contact": "Contato",
  "nav.aboutMe": "Sobre mim",
  "footer.tagline": "Construindo experiências digitais memoráveis",
  "footer.copyright": "© 2025 Felipe Amaral. Todos os direitos reservados.",
  "about.buildTogether": "Vamos Construir Juntos",
  "about.buildTogether.description": "Obrigado por ler minha história. Se você está construindo um produto, escalando uma equipe ou navegando em sua própria jornada, estou sempre aberto para trocar ideias e colaborar.",
  "about.buildTogether.cta": "Entre em Contato",
  "blog.languageIntro": "Bem-vindo ao meu blog onde compartilho pensamentos e insights sobre desenvolvimento web, design e crescimento profissional.",
  "blog.moreArticles": "Mais artigos em breve! Fique atento para atualizações.",
  "blog.checkMedium": "Confira meus artigos no Medium",
  "medium.loading": "Carregando posts recentes...",
  "medium.error": "Não foi possível carregar os posts do Medium no momento. Por favor, volte mais tarde.",
  "medium.noPostsFound": "Nenhum post encontrado.",
  "medium.visitProfile": "Visitar Perfil no Medium",
  "medium.latestPosts": "Meus Posts Recentes no Medium",
  "speaking.events": "Eventos Futuros & Passados",
  "speaking.interested": "Interessado em me ter como palestrante no seu evento?",
  "speaking.available": "Estou disponível para palestras sobre tópicos relacionados a desenvolvimento web, design, acessibilidade e crescimento de carreira. Sinta-se à vontade para entrar em contato com detalhes sobre seu evento.",
  "mentorship.passion": "Sou apaixonado por ajudar outros a crescerem em suas carreiras tech através de mentoria personalizada focada tanto em habilidades técnicas quanto em desenvolvimento de carreira.",
  "mentorship.experience": "Com anos de experiência na indústria, forneço orientação sobre como navegar no panorama tecnológico, desenvolver habilidades em demanda e encontrar seu caminho único para o sucesso.",
  "mentorship.approach": "Minha abordagem de mentoria é adaptada aos seus objetivos individuais, seja você apenas começando, procurando avançar em sua função atual ou considerando uma mudança de carreira dentro da tecnologia.",
  "mentorship.journey": "Minha Jornada Profissional",
  "mentorship.growing": "Para Aqueles Que Buscam Crescer",
  "mentorship.advice1": "Se você busca crescer em sua carreira tech, acredito que as qualidades mais importantes são curiosidade, persistência e disposição para aprender continuamente. A indústria tech está sempre evoluindo, e aqueles que têm sucesso são os que se adaptam e crescem com ela.",
  "mentorship.advice2": "Meu conselho é focar não apenas em habilidades técnicas, mas também em comunicação, colaboração e compreensão do contexto de negócios do seu trabalho. Essa abordagem holística irá destacá-lo e abrir mais portas conforme sua carreira avança.",
  "mentorship.interested": "Interessado em Mentoria?",
  "mentorship.offer": "Ofereço mentoria personalizada com base em seus objetivos e necessidades específicos. Seja você procurando orientação sobre habilidades técnicas, decisões de carreira ou desenvolvimento profissional, estou aqui para ajudar.",
  "mentorship.fillForm": "Preencha o formulário com alguns detalhes sobre o que você está procurando, e entrarei em contato para discutir como podemos trabalhar juntos.",
  "contact.letsConnect": "Vamos Conectar",
  "contact.interested": "Interessado em mentoria, networking ou discussão de estratégias de produto? Estou sempre aberto a me conectar com outros entusiastas de produto e compartilhar insights da minha experiência.",
  "contact.response": "Normalmente respondo mensagens em 24-48 horas. Ansioso para nos conectarmos!",
  "contact.reachOut": "Entre em Contato para Mentoria e Networking",
  "contact.shareInterests": "Compartilhe seus interesses, perguntas ou ideias para colaboração. Estou aberto a me conectar com profissionais de produto, entusiastas de tecnologia e qualquer pessoa interessada no espaço de HRTech.",
  "contact.sending": "Enviando...",
  "contact.nameRequired": "Nome é obrigatório",
  "contact.emailRequired": "Email é obrigatório",
  "contact.emailInvalid": "Endereço de email inválido",
  "contact.messageRequired": "Mensagem é obrigatória",
  "contact.howHelp": "Como posso ajudar? (Mentoria, networking, oportunidade de palestra, etc.)",
  "notFound.title": "404",
  "notFound.message": "Oops! Página não encontrada",
  "notFound.description": "A página que você está procurando pode ter sido removida, teve seu nome alterado ou está temporariamente indisponível.",
  "notFound.returnHome": "Voltar para o Início"
}
